RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/drivers/drv_uart.c
      rt_interrupt_leave();
  }

  #endif /* BSP_USING_LPUART10 */

  #if defined(BSP_USING_LPUART11)

  void LPUART11_IRQHandler(void)
  {
      rt_interrupt_enter();

      uart_isr(&uarts[LPUART11_INDEX]);

      rt_interrupt_leave();
  }

  #endif /* BSP_USING_LPUART11 */

  #if defined(BSP_USING_LPUART12)

  void LPUART12_IRQHandler(void)
  {
      rt_interrupt_enter();

      uart_isr(&uarts[LPUART12_INDEX]);

      rt_interrupt_leave();
  }

  #endif /* BSP_USING_LPUART12 */
static void uart_isr(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    rt_size_t total_index, recv_len;
    rt_base_t level;
#endif

    /* kLPUART_RxDataRegFullFlag can only cleared or set by hardware */
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_IND);
    }

    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxOverrunFlag)
    {
        /* Clear overrun flag, otherwise the RX does not work. */
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_RxOverrunFlag);
    }

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    if ((LPUART_GetStatusFlags(uart->uart_base) & kLPUART_IdleLineFlag) && (uart->dma_rx != RT_NULL))
    {
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_IdleLineFlag);
        level = rt_hw_interrupt_disable();

        total_index = uart->serial.config.bufsz - EDMA_GetRemainingMajorLoopCount(DMA0, uart->dma_rx->channel);
        if (total_index > uart->dma_rx->last_index)
        {
            recv_len = total_index - uart->dma_rx->last_index;
        }
        else
        {
            recv_len = total_index + (uart->serial.config.bufsz - uart->dma_rx->last_index);
        }

        if ((recv_len > 0) && (recv_len < uart->serial.config.bufsz))
        {
            uart->dma_rx->last_index = total_index;
            rt_hw_interrupt_enable(level);

            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
        else
        {
            rt_hw_interrupt_enable(level);
        }
    }
#endif
}

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
void edma_rx_callback(struct _edma_handle *handle, void *userData, bool transferDone, uint32_t tcds)
{
    rt_size_t total_index, recv_len;
    rt_base_t level;
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (transferDone)
    {
        level = rt_hw_interrupt_disable();

        if ((EDMA_GetChannelStatusFlags(DMA0, uart->dma_rx->channel) & kEDMA_DoneFlag) != 0U)
        {
            /* clear full interrupt */
            EDMA_ClearChannelStatusFlags(DMA0, uart->dma_rx->channel,kEDMA_DoneFlag);

            recv_len = uart->serial.config.bufsz - uart->dma_rx->last_index;
            uart->dma_rx->last_index = 0;
        }
        else
        {
            /* clear half interrupt */
            EDMA_ClearChannelStatusFlags(DMA0, uart->dma_rx->channel,kEDMA_InterruptFlag);

            total_index = uart->serial.config.bufsz - EDMA_GetRemainingMajorLoopCount(DMA0, uart->dma_rx->channel);
            if (total_index > uart->dma_rx->last_index)
            {
                recv_len = total_index - uart->dma_rx->last_index;
            }
            else
            {
                recv_len = total_index + (uart->serial.config.bufsz - uart->dma_rx->last_index);
            }
            uart->dma_rx->last_index = total_index;
        }

        rt_hw_interrupt_enable(level);

        if (recv_len)
        {
            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
    }
}

void edma_tx_callback(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status, void *userData)
{
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (kStatus_LPUART_TxIdle == status)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_TX_DMADONE);
    }
}
  static void imxrt_dma_rx_config(struct imxrt_uart *uart)
  {
      RT_ASSERT(uart != RT_NULL);

      edma_transfer_config_t xferConfig;
      struct rt_serial_rx_fifo *rx_fifo;

  #ifndef SOC_IMXRT1180_SERIES
      DMAMUX_SetSource(DMAMUX, uart->dma_rx->channel, uart->dma_rx->request);
      DMAMUX_EnableChannel(DMAMUX, uart->dma_rx->channel);
  #else
      /* RT1180 uses EDMA4, configure DMA request source differently */
      EDMA_SetChannelMux(DMA0, uart->dma_rx->channel, uart->dma_rx->request);
  #endif
    
      EDMA_CreateHandle(&uart->dma_rx->edma, DMA0, uart->dma_rx->channel);
      EDMA_SetCallback(&uart->dma_rx->edma, edma_rx_callback, uart);

      rx_fifo = (struct rt_serial_rx_fifo *)uart->serial.serial_rx;

      EDMA_PrepareTransfer(&xferConfig,
                         (void *)LPUART_GetDataRegisterAddress(uart->uart_base),
                         sizeof(uint8_t),
                         rx_fifo->buffer,
                         sizeof(uint8_t),
                         sizeof(uint8_t),
                         uart->serial.config.bufsz,
                         kEDMA_PeripheralToMemory);

      EDMA_SubmitTransfer(&uart->dma_rx->edma, &xferConfig);
      EDMA_EnableChannelInterrupts(DMA0, uart->dma_rx->channel, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
      EDMA_EnableAutoStopRequest(DMA0, uart->dma_rx->channel, false);
      /* complement to adjust final destination address */
      uart->dma_rx->edma.base->TCD[uart->dma_rx->channel].DLAST_SGA = -(uart->serial.config.bufsz);
      EDMA_StartTransfer(&uart->dma_rx->edma);
      LPUART_EnableRxDMA(uart->uart_base, true);

      LPUART_EnableInterrupts(uart->uart_base, kLPUART_IdleLineInterruptEnable);
      NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
      EnableIRQ(uart->irqn);

      LOG_D("%s dma rx config done\n", uart->name);
  }

  static void imxrt_dma_tx_config(struct imxrt_uart *uart)
  {
      RT_ASSERT(uart != RT_NULL);

  #ifndef SOC_IMXRT1180_SERIES
      DMAMUX_SetSource(DMAMUX, uart->dma_tx->channel, uart->dma_tx->request);
      DMAMUX_EnableChannel(DMAMUX, uart->dma_tx->channel);
  #else
      /* RT1180 uses EDMA4, configure DMA request source differently */
      EDMA_SetChannelMux(DMA0, uart->dma_tx->channel, uart->dma_tx->request);
  #endif
    
